# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

# x = int(input("Введите координату X: "))
# y = int(input("Введите координаты Y: "))

print ('Введите координату точки A в формате (x,y): ')
xA, yA = input().split(',')

print ('Введите координату точки B в формате (x,y): ')
xB, yB = input().split(',')

Z = round(((float(xB) - float(xA))**2 + (float(yB) - float(yA))**2)**(0.5),2)


print('Расстояние между точками = ', Z)