# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] 

k = int(input('Введите число для расчета чисел Фибоначчи: '))


def Fib(k):
    if k in (1, 2):
        return 1
    return Fib(k - 1)+Fib(k-2)


lst = [-Fib(k), Fib(k-1)]

for i in range (2, 2*k+1):
    lst.append(lst[i-1] + lst[i-2])

print(lst)