# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 12, 123, 1234)

N = int(input("Введите целое число N: "))

sum = 1
lst = []
for i in range(1, N + 1):
    sum*=i
    lst.append(sum)

print(lst)

#Решение через рекурсию по семинару

# def Fib(N):
#     if N == 1:
#         return N
#     return N * Fib(N - 1)

# print(Fib(5))