# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да   - 7 -> да   - 1 -> нет

day = int(input("Введите цифру числа недели: "))

if day <=0 or day > 7:
    print('Такого дня недели не существует')
elif day == 6 or day == 7:
    print('Это ВЫХОДНОЙ!')
else:
    print('Это не выходной')