# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".

text = 'Жил-был маленький автобус. У него был удобный руль, мягкие сидения и еще много чего красивого и интересного. Звали маленький автобус Жёлтик. Он был очень доволен тем, что родился автобусом.'

text = text.split()

# print(text)

text = filter(lambda word: 'а' not in word or 'б' not in word or 'в' not in word, text)

print(*text)
