# Вычислить число c заданной точностью d
# Пример:
# - при d = 0.001, π = 3.142,    10^(-1) ≤ d ≤10^(-10)


N = float(input('Введите число для округления: '))
d = float(input('Введите число d: '))

count = 0
if d < 10**(-10) or d > 10**(-1):
    print('Введите число d в диапазоне от 10^(-10) до 10^(-1)')
else:
    while d < 1:
        d *= 10
        count += 1  
    print(round(N, count))