# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

A = int(input("Введите номер плоскости: "))

if A == 1:
    print('Плоскость положительных координат X (X>0) и положительных координат Y (Y>0)')
elif A == 2:
    print('Плоскость отрицательных координат X (X<0) и положительных координат Y (Y>0)')
elif A == 3:
    print('Плоскость отрицательных координат X (X<0) и отрицательных координат Y (Y<0)')
elif A == 4:
    print('Плоскость положительных координат X (X>0) и отрицательных координат Y (Y<0)')
