# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

arr = [5,3,4,1,0,9,5,3,7]
res = []
i=0
while i < len(arr) / 2 :
    mult = arr[i]*arr[-1-i]
    res.append(mult)
    i=i+1

print(res)